src/main/resources/plans/StepLoad.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0">
<hashTree>

<TestPlan guiclass="TestPlanGui"
          testclass="TestPlan"
          testname="Step Load Test"
          enabled="true"/>

<hashTree>

<ThreadGroup guiclass="ThreadGroupGui"
             testclass="ThreadGroup"
             testname="Step Users"
             enabled="true">

<stringProp name="ThreadGroup.num_threads">${__P(threads,100)}</stringProp>

<stringProp name="ThreadGroup.ramp_time">${__P(rampUp,10)}</stringProp>

<longProp name="ThreadGroup.start_time">0</longProp>
<longProp name="ThreadGroup.end_time">0</longProp>

<elementProp name="ThreadGroup.main_controller"
             elementType="LoopController"
             guiclass="LoopControlPanel"
             testclass="LoopController"
             testname="Loop Controller"
             enabled="true">

<boolProp name="LoopController.continue_forever">false</boolProp>

<stringProp name="LoopController.loops">${__P(loops,10)}</stringProp>

</elementProp>

</ThreadGroup>

<hashTree>

<ConstantTimer guiclass="ConstantTimerGui"
               testclass="ConstantTimer"
               testname="Step Delay"
               enabled="true">

<stringProp name="ConstantTimer.delay">100</stringProp>

</ConstantTimer>

<hashTree/>

<HTTPSamplerProxy guiclass="HttpTestSampleGui"
                  testclass="HTTPSamplerProxy"
                  testname="HTTP Request"
                  enabled="true">

<stringProp name="HTTPSampler.domain">${__P(host)}</stringProp>
<stringProp name="HTTPSampler.port">${__P(port)}</stringProp>
<stringProp name="HTTPSampler.path">${__P(path)}</stringProp>
<stringProp name="HTTPSampler.method">GET</stringProp>

</HTTPSamplerProxy>

<hashTree/>

</hashTree>

<ResultCollector guiclass="SimpleDataWriter"
                 testclass="ResultCollector"
                 testname="Save Results"
                 enabled="true">

<stringProp name="filename">${__P(jtl)}</stringProp>

</ResultCollector>

<hashTree/>

</hashTree>
</hashTree>
</jmeterTestPlan>