src/main/resources/plans/WaveLoad.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0">
<hashTree>

<TestPlan guiclass="TestPlanGui"
          testclass="TestPlan"
          testname="Wave Load Test"
          enabled="true"/>
<hashTree>

<!-- WAVE UP -->
<ThreadGroup guiclass="ThreadGroupGui"
             testclass="ThreadGroup"
             testname="Wave Up"
             enabled="true">

<stringProp name="ThreadGroup.num_threads">${__P(threads,400)}</stringProp>
<stringProp name="ThreadGroup.ramp_time">${__P(rampUp,30)}</stringProp>

<longProp name="ThreadGroup.start_time">0</longProp>
<longProp name="ThreadGroup.end_time">0</longProp>

<elementProp name="ThreadGroup.main_controller"
             elementType="LoopController"
             guiclass="LoopControlPanel"
             testclass="LoopController"
             testname="Loop Controller"
             enabled="true">

<boolProp name="LoopController.continue_forever">false</boolProp>
<stringProp name="LoopController.loops">${__P(loops,5)}</stringProp>

</elementProp>

</ThreadGroup>

<hashTree>

<HTTPSamplerProxy guiclass="HttpTestSampleGui"
                  testclass="HTTPSamplerProxy"
                  testname="HTTP Request Wave Up"
                  enabled="true">

<stringProp name="HTTPSampler.domain">${__P(host)}</stringProp>
<stringProp name="HTTPSampler.port">${__P(port)}</stringProp>
<stringProp name="HTTPSampler.path">${__P(path)}</stringProp>
<stringProp name="HTTPSampler.method">GET</stringProp>

</HTTPSamplerProxy>

<hashTree/>

</hashTree>

<!-- WAVE DOWN -->
<ThreadGroup guiclass="ThreadGroupGui"
             testclass="ThreadGroup"
             testname="Wave Down"
             enabled="true">

<stringProp name="ThreadGroup.num_threads">100</stringProp>
<stringProp name="ThreadGroup.ramp_time">20</stringProp>

<longProp name="ThreadGroup.start_time">0</longProp>
<longProp name="ThreadGroup.end_time">0</longProp>

<elementProp name="ThreadGroup.main_controller"
             elementType="LoopController"
             guiclass="LoopControlPanel"
             testclass="LoopController"
             testname="Loop Controller"
             enabled="true">

<boolProp name="LoopController.continue_forever">false</boolProp>
<stringProp name="LoopController.loops">5</stringProp>

</elementProp>

</ThreadGroup>

<hashTree>

<HTTPSamplerProxy guiclass="HttpTestSampleGui"
                  testclass="HTTPSamplerProxy"
                  testname="HTTP Request Wave Down"
                  enabled="true">

<stringProp name="HTTPSampler.domain">${__P(host)}</stringProp>
<stringProp name="HTTPSampler.port">${__P(port)}</stringProp>
<stringProp name="HTTPSampler.path">${__P(path)}</stringProp>
<stringProp name="HTTPSampler.method">GET</stringProp>

</HTTPSamplerProxy>

<hashTree/>

</hashTree>

<!-- RESULT WRITER -->
<ResultCollector guiclass="SimpleDataWriter"
                 testclass="ResultCollector"
                 testname="Save Results"
                 enabled="true">

<stringProp name="filename">${__P(jtl)}</stringProp>

</ResultCollector>

<hashTree/>

</hashTree>
</hashTree>
</jmeterTestPlan>